[
  {
    "image": "/images/myProjects/2_project.svg",
    "title": "E-commerce API Documentation",
    "description": "Dynamic E-Commerce Workflow with order processing, real-time inventory updates, secure authentication, automated reporting, and full product management. Publicly documented API available on Postman.",
    "link": "https://documenter.getpostman.com/view/46298084/2sB34hEzKx"
  },
  {
    "image": "/images/myProjects/3_project.svg",
    "title": "E-commerce App",
    "description": "MERN E-Commerce Platform. The platform features dynamic product catalog with filtering and sorting, real-time search, seamless cart updates, secure checkout, and a comprehensive admin dashboard with real-time analytics and user management capabilities.",
    "link": "http://zuitt-bootcamp-prod-560-8928-bongabong.s3-website.us-east-1.amazonaws.com/"
  },
  {
    "image": "/images/myProjects/Fitness Documentation.svg",
    "title": "Fitness API Documentation",
    "description": "Fitness API Documentation outlines endpoints for user management, authentication, and workout tracking, with examples and error handling. The API is deployed on Render and is publicly available on Postman.",
    "link": "https://documenter.getpostman.com/view/45081082/2sB3BEoAPs"
  },
  {
    "image": "/images/myProjects/FitnessAPP.svg",
    "title": "Fitness Workout Tracker App",
    "description": "Fitness Workout Tracker App lets users log workouts, monitor progress, and set fitness goals with ease. It offers real-time updates and a simple interface to keep training consistent and motivating.",
    "link": "https://fitness-tracker-frontend-rose.vercel.app/"
  },
  {
    "image": "/images/myProjects/Movie Documentation.svg",
    "title": "Movie Catalog API Documentation",
    "description": "Movie Catalog API Documentation details endpoints for managing movies, user authentication, and comments, with request/response examples and error handling. The API is deployed on Render and publicly available on Postman for easy testing and integration.",
    "link": "https://documenter.getpostman.com/view/45081082/2sB3BEoAPz"
  },
  {
    "image": "/images/myProjects/Movie APP.svg",
    "title": "Movie Catalog App",
    "description": "Movie Catalog App allows users to browse, search, and comment on movies with an intuitive and responsive design. It is deployed on Vercel, ensuring fast load times and reliable performance.",
    "link": "https://movie-catalog-app-weld.vercel.app/"
  },
   {
    "image": "/images/myProjects/Blog Documentation.svg",
    "title": "Blog Post API Documentation",
    "description": "Blog API provides endpoints for managing blog posts, user authentication, and comments, complete with examples and error handling. Deployed on Render, it is publicly available on Postman for easy testing and integration.",
    "link": "https://documenter.getpostman.com/view/45081082/2sB3BEoAYh"
  },
   {
    "image": "/images/myProjects/Blog APP.svg",
    "title": "Blog Post App",
    "description": "Blog Post App allows users to share their travel experiences, read inspiring stories, and engage through comments. It features a clean, responsive design for easy navigation on any device. Deployed on Vercel, it ensures fast performance and a smooth user experience.",
    "link": "https://blogpost-client-sage.vercel.app/"
  },
   {
    "image": "/images/myProjects/7.svg",
    "title": "Static E-Commerce Page",
    "description": "Sample static homepage for a Aloe-vera products E-Commerce Store, featuring product highlights, categories, and a clean, modern layout.",
    "link": "https://josephaaron1207.github.io/home-page-exam/"
  },
  {
    "image": "/images/myProjects/8.svg",
    "title": "Coding Educational Platform Homepage",
    "description": "Sample static homepage for a Robo-Tech Educational Platform using a static webpage design. It highlights featured courses, learning categories, and key program details in a clean, modern layout. The design aims to provide an engaging and easy-to-navigate experience for learners.",
    "link": "https://josephaaron1207.github.io/Educational-Hub/"
  }
]